sap fetch prices according to the group name

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope
    xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:n0="http://sap.com/xi/A1S/Global">

  <soap-env:Header/>

  <soap-env:Body>
    <n0:SalesPriceListFindByIDQuery_sync>
      <SalesPriceList>
        <ID>{{PRICE_LIST_ID}}</ID>
      </SalesPriceList>
    </n0:SalesPriceListFindByIDQuery_sync>
  </soap-env:Body>
</soap-env:Envelope>
